tap "aquasecurity/trivy"
tap "buildpacks/tap"
tap "derailed/k9s"
tap "knative-extensions/kn-plugins"
tap "knative/client"
tap "nikitabobko/tap"
tap "telepresenceio/telepresence"
brew "atuin"
brew "bat"
brew "cliclick"
brew "colima", restart_service: :changed
brew "cowsay"
brew "ctop"
brew "fd"
brew "fortune"
brew "fzf"
brew "gh"
brew "git-delta"
brew "glow"
brew "helm"
brew "htop"
brew "kubectx"
brew "lazygit"
brew "lsd"
brew "mercurial"
brew "minikube"
brew "neovim"
brew "node"
brew "openfortivpn"
brew "sslscan"
brew "swagger-codegen"
brew "tree"
brew "virtctl", link: false
brew "watch"
brew "websocat"
brew "yamllint"
brew "yq"
brew "aquasecurity/trivy/trivy"
brew "buildpacks/tap/pack"
brew "derailed/k9s/k9s"
brew "knative-extensions/kn-plugins/func"
brew "knative/client/kn"
brew "telepresenceio/telepresence/telepresence-oss"
cask "aerospace"
cask "codex"
cask "gcloud-cli"
cask "maccy"
cask "nordvpn"
cask "whatsapp"
vscode "arjun.swagger-viewer"
vscode "bierner.markdown-mermaid"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "pomdtr.excalidraw-editor"
vscode "tomoki1207.pdf"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/jesseduffield/lazydocker"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-grpc-gateway"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-openapiv2"
go "github.com/kluisz/grpc-core/protoc-gen-routes"
go "honnef.co/go/tools/cmd/staticcheck"
