# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# ==============================================================================
# Core CLI Tools
# ==============================================================================

brew "git"
brew "neovim"
brew "htop"
brew "tree"
brew "watch"
brew "curl"
brew "wget"

# ==============================================================================
# Modern CLI Replacements
# ==============================================================================

brew "bat"              # Better cat
brew "eza"              # Better ls (modern replacement for lsd)
brew "lsd"              # Better ls (original)
brew "ripgrep"          # Better grep
brew "fd"               # Better find
brew "git-delta"        # Better diff
brew "fzf"              # Fuzzy finder
brew "procs"            # Better ps
brew "dust"             # Better du
brew "duf"              # Better df
brew "bottom"           # Better top (btm)

# ==============================================================================
# Shell & Terminal
# ==============================================================================

brew "atuin"            # Shell history
brew "zoxide"           # Smarter cd (alternative to z)
brew "starship"         # Cross-shell prompt (optional alternative to p10k)

# ==============================================================================
# JSON/YAML/Data Processing
# ==============================================================================

brew "jq"               # JSON processor
brew "yq"               # YAML processor
brew "yamllint"         # YAML linter

# ==============================================================================
# Git & GitHub
# ==============================================================================

brew "gh"               # GitHub CLI
brew "lazygit"          # TUI for git
brew "git-lfs"          # Large file storage

# ==============================================================================
# Docker & Containers
# ==============================================================================

brew "colima"           # Docker runtime for macOS
brew "docker"           # Docker CLI
brew "docker-compose"   # Docker Compose
brew "lazydocker"       # TUI for docker
brew "dive"             # Analyze docker images
brew "ctop"             # Container metrics

# ==============================================================================
# Kubernetes
# ==============================================================================

brew "kubernetes-cli"   # kubectl
brew "helm"             # Kubernetes package manager
brew "k9s"              # TUI for Kubernetes
brew "kubectx"          # Context/namespace switcher (includes kubens)
brew "minikube"         # Local Kubernetes
brew "kn"               # Knative CLI
brew "stern"            # Multi-pod log tailing

# ==============================================================================
# Cloud CLIs
# ==============================================================================

brew "awscli"           # AWS CLI

# ==============================================================================
# Security & Scanning
# ==============================================================================

brew "trivy"            # Vulnerability scanner
brew "sslscan"          # SSL scanner

# ==============================================================================
# Development Tools
# ==============================================================================

brew "swagger-codegen"  # API code generator
brew "pack"             # Cloud Native Buildpacks
brew "httpie"           # Better curl for APIs
brew "websocat"         # WebSocket CLI

# ==============================================================================
# Documentation & Markdown
# ==============================================================================

brew "tldr"             # Simplified man pages
brew "glow"             # Markdown renderer

# ==============================================================================
# Diff & Comparison
# ==============================================================================

brew "difftastic"       # Structural diff

# ==============================================================================
# Fun / Misc
# ==============================================================================

brew "fortune"
brew "cowsay"

# ==============================================================================
# Casks (GUI Applications)
# ==============================================================================

cask "iterm2"           # Terminal emulator
cask "visual-studio-code"
cask "google-cloud-sdk" # GCloud CLI
cask "docker"           # Docker Desktop (optional, use colima instead)

# Fonts
cask "font-meslo-lg-nerd-font"      # Nerd Font for Powerlevel10k
cask "font-fira-code-nerd-font"     # Alternative nerd font
cask "font-jetbrains-mono-nerd-font" # JetBrains Mono
